emacs/.emacs.d/init.org
#+title: DOOMED
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el
* Display
Just basic stuff + Font 
#+BEGIN_SRC emacs-lisp
  (setq inhibit-startup-message t)
  (setq user-full-name "Eddie Xiao"
	user-mail-address "eddie.j.xiao@gmail.com")

  (set-face-attribute 'default nil :font "JetBrainsMono Nerd Font Mono" :height 158) 
#+END_SRC

Makes emacs more minimal, no startup message, toolbars, scroll (Not sure if I need both)
#+begin_src emacs-lisp
  (tool-bar-mode -1)
  (menu-bar-mode -1) 
  (toggle-scroll-bar -1)
  (scroll-bar-mode 0)
#+end_src

* Custom Vars
Not using too much, just loading for future use
#+begin_src emacs-lisp
  (setq custom-file "~/.emacs.d/custom.el")
  (load custom-file 'noerror 'nomessage)
#+end_src

* Packages
Use-package is too good to pass on, having params from :init to :custom 
#+begin_src emacs-lisp
    (require 'package)
    (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			     ("org" . "https://orgmode.org/elpa/")
			     ("elpa" . "https://elpa.gnu.org/packages/")
			    ("melpa-stable" . "http://stable.melpa.org/packages/") 
  ))
    (package-initialize)
    (unless package-archive-contents
      (package-refresh-contents))

    (unless (package-installed-p 'use-package)
      (package-install 'use-package))

    (require 'use-package)
    (setq use-package-always-ensure t)

#+end_src

* Quality of Life
Yes/NO VS y/n
#+begin_src emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+end_src
Line Numbers Please
#+begin_src emacs-lisp
  (column-number-mode)
  (global-display-line-numbers-mode t)
  (setq display-line-numbers-type 'relative)
#+end_src
Which Key
#+begin_src emacs-lisp
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 1))
#+end_src
Don't clobber crap with so many tmp files
#+begin_src emacs-lisp
(setq
   backup-by-copying t      ; don't clobber symlinks
   backup-directory-alist
    '(("." . "~/.emacs.d/backup"))    ; don't litter my fs tree
   delete-old-versions t
   kept-new-versions 6
   kept-old-versions 2
   version-control t)       ; use versioned backups
#+end_src

* Tab Bar
#+begin_src emacs-lisp
  ;; (tab-bar-mode 1)
  ;; (setq tab-bar-close-button-show nil

  ;; tab-bar-button-relief 0)
#+end_src
Centuar Tabs Instead
#+begin_src emacs-lisp
  ;; (use-package centaur-tabs     
  ;; :demand
  ;; :config
  ;; (centaur-tabs-mode t)
  ;; :bind
  ;; ("C-<prior>" . centaur-tabs-backward)
  ;; ("C-<next>" . centaur-tabs-forward))
#+end_src

* Perspective
#+begin_src emacs-lisp
  (use-package perspective
    :bind
    (("C-x C-b" . persp-counsel-switch-buffer)         ; or use a nicer switcher, see below

     ("M-1" . (lambda () (interactive) (persp-switch-by-number 1)))
     ("M-2" . (lambda () (interactive) (persp-switch-by-number 2)))
     ("M-3" . (lambda () (interactive) (persp-switch-by-number 3)))
     ("M-4" . (lambda () (interactive) (persp-switch-by-number 4)))
     ("M-5" . (lambda () (interactive) (persp-switch-by-number 5)))
     )

    :custom
    (persp-mode-prefix-key (kbd "C-c C-p"))  ; pick your own prefix key here, might never use 
    :init
    (persp-mode))
#+end_src
Project persp
#+begin_src emacs-lisp
  (use-package persp-projectile)
#+end_src
Use alt 1-9 to switch between workspaces
** Current wflow
 - Space-p-p to start project and create new perspective for it
 - Use projectile commands to interact with it

* General Keymap
Use general for keymaps + LeaderKey idea
#+begin_src emacs-lisp
  (use-package general
    :config
    (general-auto-unbind-keys nil)
    (general-create-definer ex/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")

    (general-evil-setup)) 
#+end_src

* EVIL MODE
Sane Evil Config 
#+begin_src emacs-lisp
  (use-package evil
					  ; SET BEFORE EVIl RUNS
    :init 
    (setq evil-want-C-u-scroll t)
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-i-jump t)
    (setq evil-want-C-u-delete t)
					  ; Runs after package loads
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

#+end_src


Copies Vim copasta setup, Y yanks to system y to vim, p pastes, C-P paste from system
Evil-yank-fake is just the regular function but clipboards hooked at the start and end of it, need to figure out how to use real hooks instead
#+begin_src emacs-lisp
    :bind (
	   ("C-p" . (lambda () (interactive) (evil-paste-from-register ?+)))
	   :map evil-normal-state-map
	   ("C-p" . (lambda () (interactive) (evil-paste-from-register ?+)))
	   ("Y" . evil-yank-fake)
	   :map evil-insert-state-map
	   ("C-p" . (lambda () (interactive) (evil-paste-from-register ?+)))
	   :map evil-visual-state-map
	   ("C-p" . (lambda () (interactive) (evil-paste-from-register ?+)))
	   ("Y" . copy-to-clipboard-visual)

	   )
    )
#+end_src

Testing this crap
#+begin_src emacs-lisp
  (remove-hook 'tty-setup-hook 'doom-init-clipboard-in-tty-emacs-h)
#+end_src

JK Beats <ESC> by a lot, first option freezes j, general's timeout fixes this
#+begin_src emacs-lisp
					  ; (setq-default evil-escape-key-sequence "jk")
  (general-imap "j"
    (general-key-dispatch 'self-insert-command
      :timeout 0.1
      "k" 'evil-normal-state))

#+end_src

Makes evil work in stuff like dired and magit
#+begin_src emacs-lisp
  (use-package evil-collection
    :after evil
    :ensure t
    :config
    (evil-collection-init))
#+end_src


Not in :bind section as thats overwritten
#+begin_src emacs-lisp
#+end_src
Highlights yanked stuff
#+begin_src emacs-lisp
  (use-package evil-goggles
    :ensure t
    :config
    (evil-goggles-mode)
    (evil-goggles-use-diff-faces))
#+end_src
Custom functions absolute nightmare, called in evil :bind section
This is just copy wrapped in setting clipboard to system then swapping it back
#+begin_src emacs-lisp
  (defun copy-to-clipboard-visual()
    (interactive)
    (setq select-enable-clipboard t)
    (kill-ring-save (region-beginning) (region-end))
    (setq select-enable-clipboard nil))
#+end_src
Heres the yanking version of it
#+begin_src emacs-lisp
  (evil-define-operator evil-yank-fake (beg end type register yank-handler)
    "Save the characters in motion into the kill-ring."
    :move-point nil
    :repeat nil
    (interactive "<R><x><y>")
    (message "changed clipboard")
    (setq select-enable-clipboard t)
    (let ((evil-was-yanked-without-register
	   (and evil-was-yanked-without-register (not register))))
      (cond
       ((and (fboundp 'cua--global-mark-active)
	     (fboundp 'cua-copy-region-to-global-mark)
	     (cua--global-mark-active))
	(cua-copy-region-to-global-mark beg end))
       ((eq type 'block)
	(evil-yank-rectangle beg end register yank-handler))
       ((memq type '(line screen-line))
	(evil-yank-lines beg end register yank-handler))
       ((evil-yank-characters beg end register yank-handler)
	(goto-char beg))))
    (setq select-enable-clipboard nil))
#+end_src

* Ivy Whip
#+begin_src emacs-lisp
  (use-package ivy
    :diminish
    :bind (
	   ("C-s" . swiper)
	   :map ivy-minibuffer-map
	   ("C-j" . ivy-next-line)
	   ("C-k" . ivy-previous-line)
	   )
    :config
    (ivy-mode 1)
    )
#+end_src
Ivy on Steriods
#+begin_src emacs-lisp
  (use-package counsel
    :bind (
	   ("M-x" . counsel-M-x)
	   ("C-x C-f" . counsel-find-file)
	   ("C-x b" . counsel-switch-buffer)
	   )
    :custom
    (ivy-initial-inputs-alist nil)
    )

  (use-package ivy-rich
    :config
    (ivy-rich-mode 1)
    )
#+end_src
Themeing the buffer
#+begin_src emacs-lisp
  (use-package  ivy-posframe
    :ensure t
    :config
    (setq ivy-posframe-min-width 150
	  ivy-posframe-width 150)
    (setq ivy-posframe-height-alist '((swiper . 20)
				      (t      . 15)))
    :init
    (ivy-posframe-mode))
#+end_src
Set posframe to be bottem center
#+begin_src emacs-lisp
  (defun my/ivy-posframe-display-at-frame-bottom-center (str)
    (interactive)
    (ivy-posframe--display str #'posframe-poshandler-frame-bottom-center))

  (setq ivy-posframe-display-functions-alist
	'((t . my/ivy-posframe-display-at-frame-bottom-center)))

  ;; (set-face-attribute 'ivy-posframe nil :foreground "white")

#+end_src

* Eye Candy 
#+begin_src emacs-lisp
  (use-package all-the-icons
    :ensure t
    )
  (use-package doom-modeline
    :init
    (doom-modeline-mode 1)
    :custom
    (doom-modeline-height 30)
    (doom-modeline-icon t)
    )
#+end_src
Doom Themes, applied to other apps too
#+begin_src emacs-lisp
  (use-package doom-themes
    :ensure t
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
	  doom-themes-enable-italic t) ; if nil, italics is universally disabled
    (load-theme 'doom-solarized-dark t)
    ;; Enable custom neotree theme (all-the-icons must be installed!)
    (doom-themes-neotree-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config)
    )
#+end_src

(((((())))))))()()()))((()))())()
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

