emacs/.emacs.d/init.el
(setq inhibit-startup-message t)
(setq user-full-name "Eddie Xiao"
      user-mail-address "eddie.j.xiao@gmail.com")

(set-face-attribute 'default nil :font "JetBrainsMono Nerd Font Mono" :height 158)

(tool-bar-mode -1)
(menu-bar-mode -1) 
(toggle-scroll-bar -1)
(scroll-bar-mode 0)

(setq custom-file "~/.emacs.d/custom.el")
(load custom-file 'noerror 'nomessage)

(require 'package)
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			   ("org" . "https://orgmode.org/elpa/")
			   ("elpa" . "https://elpa.gnu.org/packages/")
			  ("melpa-stable" . "http://stable.melpa.org/packages/") 
))
  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)

(defalias 'yes-or-no-p 'y-or-n-p)

(column-number-mode)
(global-display-line-numbers-mode t)
(setq display-line-numbers-type 'relative)

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 1))

(setq
   backup-by-copying t      ; don't clobber symlinks
   backup-directory-alist
    '(("." . "~/.emacs.d/backup"))    ; don't litter my fs tree
   delete-old-versions t
   kept-new-versions 6
   kept-old-versions 2
   version-control t)       ; use versioned backups

;; (tab-bar-mode 1)
;; (setq tab-bar-close-button-show nil

;; tab-bar-button-relief 0)

;; (use-package centaur-tabs     
;; :demand
;; :config
;; (centaur-tabs-mode t)
;; :bind
;; ("C-<prior>" . centaur-tabs-backward)
;; ("C-<next>" . centaur-tabs-forward))

(use-package perspective
  :bind
  (("C-x C-b" . persp-counsel-switch-buffer)         ; or use a nicer switcher, see below

   ("M-1" . (lambda () (interactive) (persp-switch-by-number 1)))
   ("M-2" . (lambda () (interactive) (persp-switch-by-number 2)))
   ("M-3" . (lambda () (interactive) (persp-switch-by-number 3)))
   ("M-4" . (lambda () (interactive) (persp-switch-by-number 4)))
   ("M-5" . (lambda () (interactive) (persp-switch-by-number 5)))
   )

  :custom
  (persp-mode-prefix-key (kbd "C-c C-p"))  ; pick your own prefix key here, might never use 
  :init
  (persp-mode))

(use-package persp-projectile)

(use-package general
  :config
  (general-auto-unbind-keys nil)
  (general-create-definer ex/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")

  (general-evil-setup))

(use-package evil
					; SET BEFORE EVIl RUNS
  :init 
  (setq evil-want-C-u-scroll t)
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-i-jump t)
  (setq evil-want-C-u-delete t)
					; Runs after package loads
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

:bind (
       ("C-p" . (lambda () (interactive) (evil-paste-from-register ?+)))
       :map evil-normal-state-map
       ("C-p" . (lambda () (interactive) (evil-paste-from-register ?+)))
       ("Y" . evil-yank-fake)
       :map evil-insert-state-map
       ("C-p" . (lambda () (interactive) (evil-paste-from-register ?+)))
       :map evil-visual-state-map
       ("C-p" . (lambda () (interactive) (evil-paste-from-register ?+)))
       ("Y" . copy-to-clipboard-visual)

       )
)

(remove-hook 'tty-setup-hook 'doom-init-clipboard-in-tty-emacs-h)

; (setq-default evil-escape-key-sequence "jk")
(general-imap "j"
  (general-key-dispatch 'self-insert-command
    :timeout 0.1
    "k" 'evil-normal-state))

(use-package evil-collection
  :after evil
  :ensure t
  :config
  (evil-collection-init))



(use-package evil-goggles
  :ensure t
  :config
  (evil-goggles-mode)
  (evil-goggles-use-diff-faces))

(defun copy-to-clipboard-visual()
  (interactive)
  (setq select-enable-clipboard t)
  (kill-ring-save (region-beginning) (region-end))
  (setq select-enable-clipboard nil))

(evil-define-operator evil-yank-fake (beg end type register yank-handler)
  "Save the characters in motion into the kill-ring."
  :move-point nil
  :repeat nil
  (interactive "<R><x><y>")
  (message "changed clipboard")
  (setq select-enable-clipboard t)
  (let ((evil-was-yanked-without-register
	 (and evil-was-yanked-without-register (not register))))
    (cond
     ((and (fboundp 'cua--global-mark-active)
	   (fboundp 'cua-copy-region-to-global-mark)
	   (cua--global-mark-active))
      (cua-copy-region-to-global-mark beg end))
     ((eq type 'block)
      (evil-yank-rectangle beg end register yank-handler))
     ((memq type '(line screen-line))
      (evil-yank-lines beg end register yank-handler))
     ((evil-yank-characters beg end register yank-handler)
      (goto-char beg))))
  (setq select-enable-clipboard nil))

(use-package ivy
  :diminish
  :bind (
	 ("C-s" . swiper)
	 :map ivy-minibuffer-map
	 ("C-j" . ivy-next-line)
	 ("C-k" . ivy-previous-line)
	 )
  :config
  (ivy-mode 1)
  )

(use-package counsel
  :bind (
	 ("M-x" . counsel-M-x)
	 ("C-x C-f" . counsel-find-file)
	 ("C-x b" . counsel-switch-buffer)
	 )
  :custom
  (ivy-initial-inputs-alist nil)
  )

(use-package ivy-rich
  :config
  (ivy-rich-mode 1)
  )

(use-package  ivy-posframe
  :ensure t
  :config
  (setq ivy-posframe-min-width 150
	ivy-posframe-width 150)
  (setq ivy-posframe-height-alist '((swiper . 20)
				    (t      . 15)))
  :init
  (ivy-posframe-mode))

(defun my/ivy-posframe-display-at-frame-bottom-center (str)
  (interactive)
  (ivy-posframe--display str #'posframe-poshandler-frame-bottom-center))

(setq ivy-posframe-display-functions-alist
      '((t . my/ivy-posframe-display-at-frame-bottom-center)))

;; (set-face-attribute 'ivy-posframe nil :foreground "white")

(use-package all-the-icons
  :ensure t
  )
(use-package doom-modeline
  :init
  (doom-modeline-mode 1)
  :custom
  (doom-modeline-height 30)
  (doom-modeline-icon t)
  )

(use-package doom-themes
  :ensure t
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
	doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-solarized-dark t)
  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config)
  )

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
