emacs/.emacs.d/init.el

(use-package projectile
  :ensure t
  :init
  (projectile-mode +1)
  :bind (:map projectile-mode-map
	      ("s-p" . projectile-command-map)
	      ("C-c p" . projectile-command-map))
  :custom
  (projectile-project-search-path '("~/coding/" "~/ctf/" ))
  )

(use-package counsel-projectile
  :config
  (counsel-projectile-mode 1)
  :bind
  (("C-x b" . counsel-projectile-switch-to-buffer)
   )
  )
(use-package magit)
(use-package forge)

(use-package org
  :config

(setq org-hide-emphasis-markers t)

(setq org-ellipsis " ▾")

(setq org-agenda-files
	  '("~/life/tasks.org" "~/life/events.org" "~/life/refile.org" "~/life/school.org" "~/orgfiles/journal.org")
)
(setq org-agenda-window-setup 'only-window)

(setq org-log-done 'time)

(global-set-key (kbd "C-c a") 'org-agenda)
;; (define-key org-mode-map (kbd "S-<return>") nil)
;; (global-set-key (kbd "S-<return>") 'org-ctrl-c-ret)

(setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "SOMD(s)" "WAFO(w)" "|" "DONE(d!)")
	(sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

;; (setq org-todo-keywords
    ;; '((sequence "TODO(t!)" "NEXT(n)" "SOMD(s)" "WAFO(w)" "|" "DONE(d!)" "CANC(c!)")))

(setq org-agenda-custom-commands
		    '(("d" "Dashboard"
		       ((agenda "" ((org-deadline-warning-days 7) ))
			(todo "NEXT"
			      ((org-agenda-overriding-header "Next Tasks")))
			(tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))
("a" "Daily agenda and top priority tasks"
       ((tags-todo "*"
		   ((org-agenda-skip-function '(org-agenda-skip-if nil '(timestamp)))
		    (org-agenda-skip-function
		     `(org-agenda-skip-entry-if
		       'notregexp ,(format "\\[#%s\\]" (char-to-string org-priority-highest))))
		    (org-agenda-block-separator nil)
		    (org-agenda-overriding-header "Important tasks without a date\n")))
	(agenda "" ((org-agenda-span 1)
		    (org-deadline-warning-days 0)
		    (org-agenda-block-separator nil)
		    (org-scheduled-past-days 0)
		    ;; We don't need the `org-agenda-date-today'
		    ;; highlight because that only has a practical
		    ;; utility in multi-day views.
		    (org-agenda-day-face-function (lambda (date) 'org-agenda-date))
		    (org-agenda-format-date "%A %-e %B %Y")
		    (org-agenda-overriding-header "\nToday's agenda\n")))
	(agenda "" ((org-agenda-start-on-weekday nil)
		    (org-agenda-start-day "+1d")
		    (org-agenda-span 3)
		    (org-deadline-warning-days 0)
		    (org-agenda-block-separator nil)
		    (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
		    (org-agenda-overriding-header "\nNext three days\n")))
	(agenda "" ((org-agenda-time-grid nil)
		    (org-agenda-start-on-weekday nil)
		    ;; We don't want to replicate the previous section's
		    ;; three days, so we start counting from the day after.
		    (org-agenda-start-day "+4d")
		    (org-agenda-span 14)
		    (org-agenda-show-all-dates nil)
		    (org-deadline-warning-days 0)
		    (org-agenda-block-separator nil)
		    (org-agenda-entry-types '(:deadline))
		    (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
		    (org-agenda-overriding-header "\nUpcoming deadlines (+14d)\n")))))

		      ("n" "Next Tasks"
		       ((todo "NEXT"
			      ((org-agenda-overriding-header "Next Tasks")))))

		      ("c" "Today Only"
		(
	  (agenda ""
  ((org-agenda-span 1)
(org-agenda-day-face-function (lambda (date) 'org-agenda-date))) )
    ))
("x" "Not scheduled yet"
   ( (todo "TODO"
           (
            (org-agenda-skip-function '(org-agenda-skip-entry-if 'scheduled 'deadline 'timestamp 'regexp "desparche"                                                               ))
            )
           )
     )
   )

						      ; ("W" "Work Tasks" tags-todo "+work-email")

		      ;; Low-effort next actions
		      ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
		       ((org-agenda-overriding-header "Low Effort Tasks")
			(org-agenda-max-todos 20)
			(org-agenda-files org-agenda-files)))

		      ("w" "Workflow Status"
		       ((todo "WAIT"
			      ((org-agenda-overriding-header "Waiting on External")
			       (org-agenda-files org-agenda-files)))
			(todo "REVIEW"
			      ((org-agenda-overriding-header "In Review")
			       (org-agenda-files org-agenda-files)))
			(todo "PLAN"
			      ((org-agenda-overriding-header "In Planning")
			       (org-agenda-todo-list-sublevels nil)
			       (org-agenda-files org-agenda-files)))
			(todo "BACKLOG"
			      ((org-agenda-overriding-header "Project Backlog")
			       (org-agenda-todo-list-sublevels nil)
			       (org-agenda-files org-agenda-files)))
			(todo "READY"
			      ((org-agenda-overriding-header "Ready for Work")
			       (org-agenda-files org-agenda-files)))
			(todo "ACTIVE"
			      ((org-agenda-overriding-header "Active Projects")
			       (org-agenda-files org-agenda-files)))
			(todo "COMPLETED"
			      ((org-agenda-overriding-header "Completed Projects")
			       (org-agenda-files org-agenda-files)))
			(todo "CANC"
			      ((org-agenda-overriding-header "Cancelled Projects")
			       (org-agenda-files org-agenda-files))))))))

(setq org-tag-alist
      '((:startgroup)
					; Put mutually exclusive tags here
	(:endgroup)
	("@errand" . ?e)
	("@school" . ?s)
	("@work" . ?w)
	("@hacking" . ?h)
	("@personal". ?p)
	("@planning" . ?P)
	("idea" . ?i)
	("note" . ?n))
      )

(setq org-refile-targets
	 '(("~/life/archive.org" :maxlevel . 2)
	   ("~/life/tasks.org" :maxlevel . 2)
("~/life/events.org" :maxlevel . 2)
  ))

   ;; Save Org buffers after refiling!
   (advice-add 'org-refile :after 'org-save-all-org-buffers)

(setq org-capture-templates
	  `(("t" "Tasks / Projects")
	    ("tt" "Task" entry (file+olp "~/life/refile.org" "Inbox")
	     "* TODO  %?\n  %U\n" :kill-buffer t :empty-lines 1 )
	    ("tw" "Linked Task" entry (file+olp "~/life/refile.org" "Inbox")
	     "* TODO  %?\n  %U\n %a\n  %i" :kill-buffer t :empty-lines 1 )

	    ("e" "Event" entry (file+olp "~/life/events.org" "Events")
	     "*  %?\n  %U\n" :kill-buffer t :empty-lines 1 )

	    ("j" "Journal Entries")
	    ("jj" "Journal" entry
	     (file+olp+datetree "~/orgfiles/journal.org")
	     "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
	     ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
	     :clock-in :clock-resume
	     :empty-lines 1)
	    ("jm" "Morning Journal" entry
	     (file+olp+datetree "~/orgfiles/journal.org")
	     "\n* %<%I:%M %p> - Journal :journal:\n%?\n** Morning Entry\n*** Looking Forward To\n*** Day Plan\n*** Misc"
	     :clock-in :clock-resume
	     :empty-lines 1)
	  ("m" "Metrics Capture")
	("mw" "Weight" table-line (file+headline "~/Projects/Code/emacs-from-scratch/OrgFiles/Metrics.org" "Weight")
	 "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t)
))

(require 'org-habit)
  (add-to-list 'org-modules 'org-habit t)
  (setq org-treat-insert-todo-heading-as-state-change t)
  ;; log into LOGBOOK drawer
  (setq org-log-into-drawer t)
