emacs/.emacs.d/init.org
** Themeing
Bullets for my Valentine
#+begin_src emacs-lisp
  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode)
    (org-mode . visual-line-mode)
    (org-mode . flyspell-mode)
    )
#+end_src
Hook spacing for org-mode
#+begin_src emacs-lisp
  (defun ex/org-mode-visual-fill ()
    (setq visual-fill-column-width 200
	  visual-fill-column-center-text t)
    (setq visual-fill-column-width 103)
    (setq display-line-number-mode nil)
    (visual-fill-column-mode 1)
    )

  (use-package visual-fill-column
    :hook (org-mode . ex/org-mode-visual-fill))
#+end_src

** Company mode
#+begin_src emacs-lisp
#+end_src

** Roam
#+begin_src emacs-lisp
	      (use-package emacsql)
	      (use-package emacsql-sqlite)
	      (use-package org-roam
		  ;; :hook 
		  ;; (after-init . org-roam-mode)
		  :custom
		  (org-roam-directory "~/life/roam")
		  (org-roam-completion-everywhere t)
		  :bind 
		      (("C-c n l" . org-roam)
			   ;; ("C-c n f" . org-roam-find-file)
			   ("C-c n f" . org-roam-node-find)
			   ("C-c n i" .  org-roam-node-insert-immediate)
			   ("C-c n l" . org-roam-buffer-toggle)

			   ("C-c n b" . org-roam-switch-to-buffer)
			   ("C-c n g" . org-roam-graph-show)
			   ("C-c n a" . org-roam-alias-add)
		 :map org-mode-map
	     ("C-M-i"    . completion-at-point))
    :bind-keymap
  ("C-c n d" . org-roam-dailies-map)
	    :config
	    (org-roam-db-autosync-mode)
	)
      ;; types of tempate, fleeing, literature, permendent 
	  (setq org-roam-capture-templates
	'(("f" "Fleeing default" plain "* Context:\n%?" :target
	(file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n")
	:unnarrowed t :kill-buffer t)
    ("l" "Literature" plain "* Context:\n%?\n* References: \n\n" :target
	    (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n")
	    :unnarrowed t :kill-buffer t)
    ("p" "Permendant" plain "* Context:\n%?\n* References: \n\n" :target
	    (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n")
	    :unnarrowed t :kill-buffer t)
  ) )

      (defun org-roam-node-insert-immediate (arg &rest args)
      (interactive "P")
      (let ((args (cons arg args))
	    (org-roam-capture-templates (list (append (car org-roam-capture-templates)
						      '(:immediate-finish t)))))
	(apply #'org-roam-node-insert args)))

      (defun org-roam-node-find-immediate (arg &rest args)
      (interactive "P")
      (let ((args (cons arg args))
	    (org-roam-capture-templates (list (append (car org-roam-capture-templates)
						      '(:immediate-finish t)))))
	(apply #'org-roam-node-find args)))

	(use-package org-roam-ui
	;; :straight
	;;   (:host github :repo "org-roam/org-roam-ui" :branch "main" :files ("*.el" "out"))
	  :after org-roam
      ;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
      ;;         a hookable mode anymore, you're advised to pick something yourself
      ;;         if you don't care about startup time, use
      ;;  :hook (after-init . org-roam-ui-mode)
	  :config
	  (setq org-roam-ui-sync-theme t
		org-roam-ui-follow t
		org-roam-ui-update-on-save t
		org-roam-ui-open-on-start t))


#+end_src

** Roam Tags
#+begin_src emacs-lisp
;;     (defun +org-notes-tags-read ()
;;       "Return list of tags as set in the buffer."
;;       (org-roam--extract-tags-prop (buffer-file-name (buffer-base-buffer))))
;;   (defun +org-notes-tags-delete ()
;;     "Delete a tag from current note."
;;     (interactive)
;;     (unless (+org-notes-buffer-p)
;;       (user-error "Current buffer is not a note"))
;;     (let* ((tags (+org-notes-tags-read))
;; 	   (tag (completing-read "Tag: " tags nil 'require-match)))
;;       (+org-buffer-prop-set
;;        "ROAM_TAGS"
;;        (combine-and-quote-strings (delete tag tags)))
;;       (org-roam-db--update-tags)))
;;    (defun +org-notes-tags-add ()
;;   "Add a tag to current note."
;;   (interactive)
;;   (unless (+org-notes-buffer-p)
;;     (user-error "Current buffer is not a note"))
;;   (let* ((tags (seq-uniq
;; 		(+seq-flatten
;; 		 (+seq-flatten
;; 		  (org-roam-db-query [:select tags :from tags])))))
;; 	 (tag (completing-read "Tag: " tags)))
;;     (when (string-empty-p tag)
;;       (user-error "Tag can't be empty"))
;;     (+org-buffer-prop-set
;;      "ROAM_TAGS"
;;      (combine-and-quote-strings (seq-uniq (cons tag (+org-notes-tags-read)))))
;;     (org-roam-db--update-tags)))
;;   (defun +org-notes-buffer-p ()
;;   "Return non-nil if the currently visited buffer is a note."
;;   (and buffer-file-name
;;        (string-equal (file-name-as-directory org-roam-directory)
;;                      (file-name-directory buffer-file-name))))

;; (defun +seq-flatten (list-of-lists)
;;   "Flatten LIST-OF-LISTS."
;;   (apply #'append list-of-lists))

;; (defun +org-buffer-prop-set (name value)
;;   "Set a buffer property called NAME to VALUE."
;;   (save-excursion
;;     (widen)
;;     (goto-char (point-min))
;;     (if (re-search-forward (concat "^#\\+" name ": \\(.*\\)") (point-max) t)
;;         (replace-match (concat "#+" name ": " value))
;;       ;; find the first line that doesn't begin with ':' or '#'
;;       (let ((found))
;;         (while (not (or found (eobp)))
;;           (beginning-of-line)
;;           (if (or (looking-at "^#")
;;                   (looking-at "^:"))
;;               (line-move 1 t)
;;             (setq found t)))
;;         (insert "#+" name ": " value "\n")))))
#+end_src

** PDF
#+begin_src emacs-lisp

#+end_src
* Babel Auto Tangle init.org -> init.el
Type <el and TAB to auto complete begin_src 
#+begin_src emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)))

  (setq org-babel-python-command "python3")
  (setq org-confirm-babel-evaluate nil)
  (push '("conf-unix" . conf-unix) org-src-lang-modes)

  ;; This is needed as of Org 9.2
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))

  ;; Automatically tangle our Emacs.org config file when we save it
  (defun efs/org-babel-tangle-config ()
    (when ( or (string-equal (buffer-file-name)
			     (expand-file-name "~/.emacs.d/init.org")

			     ) (string-equal (buffer-file-name) (expand-file-name "/opt/dotdot/emacs/.emacs.d/init.org"))
			       )
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
	(org-babel-tangle))))
  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))

#+end_src

* Treesitter
#+begin_src emacs-lisp
  (use-package tree-sitter
    :config
    (global-tree-sitter-mode)
    (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode)
    )
  (use-package tree-sitter-langs
    :after tree-sitter)
#+end_src

* Lsp
