emacs/.emacs.d/init.el

(use-package lsp-mode
  ;; :init (setq lsp-keymap-prefix "SPC")
  :hook (prog-mode . lsp-mode)
  (lsp-mode . lsp-enable-which-key-integration)
  :commands lsp
  :config
  (lsp-enable-which-key-integration t)
  (define-key evil-normal-state-map "g" nil)

  (define-key evil-normal-state-map (kbd "C-c e") lsp-command-map)
  (define-key evil-normal-state-map (kbd "gr") #'lsp-rename)
  (define-key evil-normal-state-map (kbd "gd") #'lsp-find-definition)
  (define-key evil-normal-state-map (kbd "gD") #'lsp-ui-peek-find-definitions)
  (define-key evil-normal-state-map (kbd "K") #'lsp-signature-activate)
  (define-key evil-normal-state-map (kbd "C-k") 'lsp-ui-doc-show)
  :bind(
	;; ("gD" . lsp-ui-peek-find-definitions)
	;; ("gr" . lsp-rename)
	)
  )
					; Hover over tab to highlight all occurances
(setq lsp-enable-symbol-highlighting nil)
					; Cursor on func shows info
(setq lsp-ui-doc-enable nil)

					; no clue what this is
(setq lsp-lens-enable t)
					; gtfo breadline
(setq lsp-headerline-breadcrumb-enable nil)

					; Show crap on the right but no code actions
(setq lsp-ui-sideline-enable t)
(setq lsp-ui-sideline-show-code-actions nil)
					; Should get rid of swiggly lines??
(setq lsp-diagnostics-provider :none)
					; Virtual Text, Not workign ??
(setq lsp-ui-sideline-enable nil)
					; Doc on bottem?
(setq lsp-eldoc-enable-hover t)
					; lsp-signature-activate
(setq lsp-signature-auto-activate t) 
(setq lsp-signature-render-documentation t)

(setq lsp-completion-provider :company)

					; Might nil this, kinda verbose and useless
(setq lsp-completion-show-detail t)
(setq lsp-completion-show-kind t)

(use-package lsp-pyright
  :ensure t
  :hook (python-mode . (lambda ()
			 (require 'lsp-pyright)
			 (lsp))))  ; or lsp-deferred

(setq lsp-ui-peek-always-show t)

(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind (:map company-active-map
	      ("<tab>" . company-complete-selection))
  (:map lsp-mode-map
	("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (add-hook 'after-init-hook 'global-company-mode)  
  (company-idle-delay 0.0))

(use-package company-box
  :hook (company-mode . company-box-mode))

(use-package lsp-ivy
  :commands lsp-ivy-workspace-symbol
  )

(use-package evil-nerd-commenter
  :config
  (define-key evil-normal-state-map (kbd "gc")  'evilnc-comment-or-uncomment-lines )
  )

(use-package posframe)
(setq lsp-signature-function 'lsp-signature-posframe)
;; (setq lsp-ui-doc-render-function 'lsp-signature-posframe)
(setq lsp-ui-doc-position 'at-point)

(add-hook 'lsp-ui-doc-frame-mode-hook #'(lambda()(display-line-numbers-mode -1)))

(ex/leader-keys
  "p" '(:keymap projectile-command-map :wk "projectile prefix")
  ;; "g" '(:keymap lsp-command-map :wk "Lsp")
  "g" '(magit-status :which-key "Magit")
  ;; "a" '(org-agenda :which-key "Agenda")
  "c" '(org-capture :which-key "Capture")
  "r" '(org-roam-capture :which-key "Roam Capture")
  "i" '(my-edit-configuration :which-key "Edit init.org")
  )

(defun reload ()
  (interactive)
  (message "reloading crap")
  (load-file "/home/ex/.emacs.d/init.el")
  )
(global-set-key (kbd "C-S-r") 'reload)

(defun my-edit-configuration ()
  "Open the init file."
  (interactive)
  (find-file "/home/ex/.emacs.d/init.org"))

(use-package undo-tree
  :init
  (global-undo-tree-mode)
  :custom
  (undo-tree-visualizer-diff t)
  (undo-tree-visualizer-timestamps t)
  :bind (
	 ("M-u" . undo-tree-visualize)
  )
)


(defun undo-tree-split-side-by-side (original-function &rest args)
  "Split undo-tree side-by-side"
  (let ((split-height-threshold nil)
	(split-width-threshold 0))
    (apply original-function args)))

(advice-add 'undo-tree-visualize :around #'undo-tree-split-side-by-side)

(evil-set-undo-system 'undo-tree)
(setq undo-tree-auto-save-history t)
(setq undo-tree-history-directory-alist '(("." . "~/.emacs.d/undo")))
(setq undo-tree-enable-undo-in-region nil)
