emacs/.emacs.d/init.el

;; (setq plstore-cache-passphrase-for-symmetric-encryption t)
;; (require 'org-gcal)
;; (setq org-gcal-client-id "254401136944-c0mj3o48gsf7gv7s61laj1jvlpla2eki.apps.googleusercontent.com"
;; 	org-gcal-client-secret "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"
;; 	org-gcal-file-alist '(("thy.isnis@gmail.com" .  "/tmp/schedules.org"))
;; )

(use-package org-caldav
:custom
  ; (org-caldav-url "https://calendar.google.com/calendar/ical/thy.isnis%40gmail.com/private-3b6536adac15d46871df4e76b05eef1a/basic.ics")
(org-caldav-calendar-id "254401136944-c0mj3o48gsf7gv7s61laj1jvlpla2eki.apps.googleusercontent.com")
(org-caldav-inbox "/tmp/schedule.org")
(org-caldav-oauth2-client-id "254401136944-c0mj3o48gsf7gv7s61laj1jvlpla2eki.apps.googleusercontent.com")
(org-caldav-oauth2-client-secret "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")
(org-caldav-url 'google)
(org-caldav-calendar-id "thy.isnis@gmail.com")
)

(setq bnb/calfw-calendars-list nil)

      (defun bnb/add-calendar (calendar)
	(add-to-list bnb/calfw-calendars-list calendar))

      (use-package sunshine
	  :ensure t
	  :commands (bnb/get-forecast-data)
	  :config
	  (defun bnb/get-forecast-data (b e)
	    (let* ((url (sunshine-make-url sunshine-location sunshine-units sunshine-appid))
		   (forecast (if (sunshine-forecast-cache-expired url)
				 (with-current-buffer (url-retrieve-synchronously url)
				   (goto-char (point-min))
				   (sunshine-extract-response))
			       (with-temp-buffer
				 (mm-disable-multibyte)
				 (url-cache-extract (url-cache-create-filename url))
				 (sunshine-extract-response)))))
	      (cl-loop for day across (cdr (assoc 'list forecast)) collect
		       (make-cfw:event
			:title (format "%s/%s°, %s"
				       (round (cdr (assoc 'min (cdr (assoc 'temp day)))))
				       (round (cdr (assoc 'max (cdr (assoc 'temp day)))))
				       (cdr (assoc 'main (elt (cdr (assoc 'weather day)) 0))))
			:start-date (cfw:emacs-to-calendar (seconds-to-time (cdr (assoc 'dt day))))))))
    :custom
    (sunshine-location "11219,USA")
    (sunshine-appid "84a3f397fc4a4d292c608c96e8167222")
    )

      (use-package calfw
	:ensure t
	:bind (
	      ("C-c n c" . cfw:open-org-calendar)
	  )
)
	(use-package calfw-cal)
	(use-package calfw-ical)
	(use-package calfw-org)
	(use-package calfw-ical)
	;; (setq cfw:render-line-breaker cfw:render-line-breaker-none)

  (defun my-open-calendar ()
    (interactive)
    (cfw:open-calendar-buffer
     :contents-sources
     (list
      (cfw:org-create-source "Green")  ; orgmode source
      (cfw:cal-create-source "Orange") ; diary source
      (cfw:ical-create-source "gcal" "https://calendar.google.com/calendar/ical/thy.isnis%40gmail.com/private-3b6536adac15d46871df4e76b05eef1a/basic.ics" "IndianRed") ; google calendar ICS
     ))) 

(custom-set-faces
 '(cfw:face-title ((t (:foreground "#268bd2" :weight bold :height 2.0 :inherit variable-pitch))))
 '(cfw:face-header ((t (:foreground "#657b83" :weight bold))))
 '(cfw:face-sunday ((t :foreground "#657b83" :weight bold)))
 '(cfw:face-saturday ((t :foreground "#657b83"  :weight bold)))
 '(cfw:face-holiday ((t :background "#073642" :weight bold)))
 '(cfw:face-grid ((t :foreground "#586e75")))
 '(cfw:face-default-content ((t :foreground "#bfebbf")))
 '(cfw:face-periods ((t :foreground "cyan")))
 '(cfw:face-day-title ((t :background "#073642")))
 '(cfw:face-default-day ((t :weight bold :inherit cfw:face-day-title)))
 '(cfw:face-annotation ((t :foreground "red" :inherit cfw:face-day-title)))
 '(cfw:face-disable ((t :foreground "#657b83" :inherit cfw:face-day-title)))
 '(cfw:face-today-title ((t :background "#d33682" :weight bold)))
 '(cfw:face-today ((t :background: "#d33682" :weight bold)))
 '(cfw:face-select ((t :background "#268bd2")))
 '(cfw:face-toolbar ((t :foreground "#657b83" :background "#002b36")))
 '(cfw:face-toolbar-button-off ((t :foreground "#6c71c4" :weight bold)))
 '(cfw:face-toolbar-button-on ((t :foreground "#6c71c4" :weight bold))))
(setq frame-resize-pixelwise t)
